Extensions/ИнтеграцияGreenApi/Catalogs/iga_Алгоритмы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>iga_Алгоритмы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Алгоритм</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяАлгоритма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверочныйКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыАлгоритма</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/CommonModules/iga_УниверсальныеОбработчикиНаКлиенте/Ext/Module.bsl
Процедура ВставитьСсылку(Форма, ПолеHTML) Экспорт
    
    Оповещение = Новый ОписаниеОповещения("Обработчик_ВставитьСсылкуЗавершение", iga_УниверсальныеОбработчикиНаКлиенте, Новый Структура("ПолеHTML", ПолеHTML));
    ОткрытьФорму("Справочник.iga_Алгоритмы.Форма.ФормаВыбораЛюбойСсылки",, Форма,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
    
КонецПроцедуры

Процедура Обработчик_ВставитьСсылкуЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    Если Результат = Неопределено Тогда 
        Возврат; // Пользователь нажал "Отмена"
    КонецЕсли;
    
    // Получаем готовую строку с сервера
    ТекстДляВставки = iga_ОбщегоНазначенияСервер.ПолучитьТекстВставкиДляСсылки(Результат);
    
    Если ПустаяСтрока(ТекстДляВставки) Тогда 
        Возврат; 
    КонецЕсли;
    
    // Вставляем полученный код в наш HTML-редактор
    ОкноБраузера = ДополнительныеПараметры.ПолеHTML.Документ.defaultView;
    Если ОкноБраузера <> Неопределено Тогда
        ОкноБраузера.insert1CCodeAtCursor(ТекстДляВставки);
    КонецЕсли;
    
КонецПроцедуры

Процедура Обработчик_ВставитьТекстЗапросаЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    Если Результат = Неопределено Тогда 
        Возврат;
    КонецЕсли;
    
    ОкноБраузера = ДополнительныеПараметры.ПолеHTML.Документ.defaultView;
	Если ОкноБраузера <> Неопределено Тогда
		ТекстВставки = iga_УниверсальныеОбработчикиВызовСервера.СформироватьКодВставкиЗапросаНаСервере(Результат);
		
        ОкноБраузера.insert1CCodeAtCursor(ТекстВставки);
    КонецЕсли;
    
КонецПроцедуры

Процедура ВставитьТекстЗапроса(Форма, ПолеHTML) Экспорт
	
    Оповещение = Новый ОписаниеОповещения("Обработчик_ВставитьТекстЗапросаЗавершение", iga_УниверсальныеОбработчикиНаКлиенте, Новый Структура("ПолеHTML", ПолеHTML));
    ОткрытьФорму("Справочник.iga_ТекстыЗапросов.ФормаВыбора", Новый Структура("РежимВыбора, ЗакрыватьПриВыборе", Истина, Истина), 
		Форма,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	КонецПроцедуры
	
Процедура Обработчик_ПослеРедактированияАлгоритма(СтруктураАлгоритма, ДопПараметры) Экспорт
	
	Если СтруктураАлгоритма = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДопПараметры.Объект[ДопПараметры.ИмяПоля] = СтруктураАлгоритма.Алгоритм;
	Если Не ДопПараметры.ПолеПроверочногоКода = "" Тогда
		ДопПараметры.Объект[ДопПараметры.ПолеПроверочногоКода] = СтруктураАлгоритма.ПроверочныйКод;
	КонецЕсли;
	
	ДопПараметры.Форма.Модифицированность = Истина;
	
КонецПроцедуры

Процедура ОткрытьРедакторАлгоритма(ЭтаФорма, Объект, ИмяПоля, Подсказка = "", 
	ПолеПроверочногоКода = "") Экспорт
	
	ОписаниеОповещения = Новый ОписаниеОповещения("Обработчик_ПослеРедактированияАлгоритма", iga_УниверсальныеОбработчикиНаКлиенте, 
		Новый Структура("Форма, Объект, ИмяПоля, ПолеПроверочногоКода", 
			ЭтаФорма, Объект, ИмяПоля, ПолеПроверочногоКода));
			
	Если Не ПолеПроверочногоКода = "" Тогда
		ПроверочныйКод = Объект[ПолеПроверочногоКода];
	Иначе
		ПроверочныйКод = "";
	КонецЕсли;
			
	ОткрытьФорму("Обработка.iga_ОбработчикЭтапов.Форма.РедакторАлгоритмов", 
		Новый Структура("Алгоритм, Подсказка, ПроверочныйКод",
			Объект[ИмяПоля], Подсказка, ПроверочныйКод), ЭтаФорма,,,,
		ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

Процедура ПродолжитьОповещениеОЗаписи(ПараметрыОповещения, ДопПараметры) Экспорт
	
	ПараметрыОповещения.Удалить("Форма");
	ПараметрыОповещения.Удалить("МодульОповещения");
	ПараметрыОповещения.Вставить("Состояние", ПараметрыОповещения.Состояние);
	
	iga_НапоминанияВызовСервера.ОповеститьОЗаписиНаСервере(ПараметрыОповещения);
	
КонецПроцедуры

Процедура Обработчик_ВставитьПрокеркуНаСМЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    Если Результат = Неопределено Тогда 
        Возврат;
    КонецЕсли;
    
    ОкноБраузера = ДополнительныеПараметры.ПолеHTML.Документ.defaultView;
    Если ОкноБраузера <> Неопределено Тогда
        ОкноБраузера.insert1CCodeAtCursor("ШаблонПоСпециальнойМетке(""" + Строка(Результат) + """)");
    КонецЕсли;
    
КонецПроцедуры

Процедура ВставитьПроверкуНаСпецМетку(Форма, ПОлеHTML) Экспорт
	
	Оповещение = Новый ОписаниеОповещения("Обработчик_ВставитьПрокеркуНаСМЗавершение", iga_УниверсальныеОбработчикиНаКлиенте, Новый Структура("ПолеHTML", ПолеHTML));
	ОткрытьФорму("Справочник.iga_СпециальныеМетки.ФормаВыбора", 
		Новый Структура("РежимВыбора, ЗакрыватьПриВыборе", Истина, Истина), Форма,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры
